Autodesk.Revit.DB.DuplicateTypeAction
This enumerated type defines the action to be taken when there are types with the same name being pasted.
Since:
2013

Autodesk.Revit.DB.DuplicateTypeAction.Abort
Cancel the paste operation.

Autodesk.Revit.DB.DuplicateTypeAction.UseDestinationTypes
Proceed with the paste operation and use the types with the same name in the destination document.